# FloorCannotAddDirectionCurve Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..FloorCannotAddDirectionCurve Property
BuiltInFailures..::..SketchFailures Class See Also
---
Cannot add the direction curve in the floor sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FloorCannotAddDirectionCurve { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FloorCannotAddDirectionCurve As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FloorCannotAddDirectionCurve {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace